marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
    // Setting 1 of 4
    std::string optionString = (isConstantBitrate ? "3:1" : "Q0");
    sprite->fillSmoothRoundRect(20, 120, 70, 40, 3, (optionString == qualityBitrateSetting ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(optionString.c_str(), 55, 131);

    // Setting 2 of 4
    optionString = (isConstantBitrate ? "5:1" : "Q1");
    sprite->fillSmoothRoundRect(95, 120, 70, 40, 3, (optionString == qualityBitrateSetting ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(optionString.c_str(), 130, 131);

  //   Setting 3 of 4
    optionString = (isConstantBitrate ? "8:1" : "Q3");
    sprite->fillSmoothRoundRect(170, 120, 70, 40, 3, (optionString == qualityBitrateSetting ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(optionString.c_str(), 205, 131);

    // Setting 4 of 4
    optionString = (isConstantBitrate ? "12:1" : "Q5");
    sprite->fillSmoothRoundRect(245, 120, 70, 40, 3, (optionString == qualityBitrateSetting ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(optionString.c_str(), 280, 131);
  }
  else
  {
    // ProRes

    // Get the ProRes Setting
    std::string currentCodecString = currentCodec.to_string();
    std::size_t spaceIndex = currentCodecString.find(" ");
    std::string currentProResSetting = currentCodecString.substr(spaceIndex + 1); // e.g. HQ, 422, LT, PXY

    // HQ
    std::string proResLabel = "HQ";
    sprite->fillSmoothRoundRect(20, 75, 145, 40, 3, (currentProResSetting == proResLabel ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(proResLabel.c_str(), 93, 87);

    // 422
    proResLabel = "422";
    sprite->fillSmoothRoundRect(170, 75, 145, 40, 3, (currentProResSetting == proResLabel ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(proResLabel.c_str(), 242, 87);

    // LT
    proResLabel = "LT";
    sprite->fillSmoothRoundRect(20, 120, 145, 40, 3, (currentProResSetting == proResLabel ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(proResLabel.c_str(), 93, 131);

    // PXY
    proResLabel = "PXY";
    sprite->fillSmoothRoundRect(170, 120, 145, 40, 3, (currentProResSetting == proResLabel ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString(proResLabel.c_str(), 242, 131);
  }

  sprite->pushSprite(0, 0);
}

// Codec Screen for URSA Mini Pro G2
void Screen_CodecURSAMiniProG2(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Codec;

  auto camera = BMDControlSystem::getInstance()->getCamera();
  
  // TO DO
}

// Codec Screen for URSA Mini Pro 12K
void Screen_CodecURSAMiniPro12K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Codec;

  auto camera = BMDControlSystem::getInstance()->getCamera();
  
  // TO DO
}

// Codec screen - redirects to appropriate screen for camera
void Screen_Codec(bool forceRefresh = false)
{
  auto camera = BMDControlSystem::getInstance()->getCamera();

  if(camera->hasCodec())
  {
    if(camera->hasModelName())
    {
      if(camera->isPocket4K6K())
        Screen_Codec4K6K(forceRefresh); // Pocket camera
      else if(camera->isURSAMiniProG2())
        Screen_CodecURSAMiniProG2(forceRefresh); // URSA Mini Pro G2
      else if(camera->isURSAMiniPro12K())
        Screen_CodecURSAMiniPro12K(forceRefresh); // URSA Mini Pro 12K
      else
        DEBUG_DEBUG("No Codec screen for this camera.");
    } 
    else
      Screen_Codec4K6K(forceRefresh); // Handle no model name in 4K/6K screen
  }
  else
    Screen_Codec4K6K(forceRefresh); // If we don't have any codec info, we show the 4K/6K screen that shows no codec
}


// Resolution screen for Pocket 4K
void Screen_Resolution4K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Resolution;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // Pocket 4K Resolution and Sensor Windows

  // Get the current Resolution and Codec
  CCUPacketTypes::RecordingFormatData currentRecordingFormat;
  if(camera->hasRecordingFormat())
    currentRecordingFormat = camera->getRecordingFormat();

  // Get the current Codec values
  CodecInfo currentCodec = camera->getCodec();

  bool tappedAction = false;
  if(btnAPressed || btnBPressed)
  {
    DEBUG_DEBUG("Resolution4K: Btn A/B pressed");

    String currentRes = currentRecordingFormat.frameDimensionsShort_string().c_str(); // "HD", "2.6K 16:9", "4K DCI", "4K UHD", "HD"

    if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
    {
      int width = 0;
      int height = 0;
      bool window = false;

      if(currentRes == "4K DCI")
      {
        if(btnAPressed)
        {
          // 4K 2.4:1
          width = 4096; height = 1720;
          window = true;
        }
        else
        {
          // HD
          width = 1920; height = 1080;
          window = true;
        }
      }
      else if(currentRes == "4K 2.4:1")
      {
        if(btnAPressed)
        {
          // 4K UHD
          width = 3840; height = 2160;
          window = true;
        }
        else
        {
          // 4K DCI
          width = 4096; height = 2160;
        }
      }
      else if(currentRes == "4K UHD")
      {
        if(btnAPressed)
        {
          // 2.8K Ana
          width = 2880; height = 2160;
          window = true;
        }
        else
        {
          // 4K 2.4:1
          width = 4096; height = 1720;
          window = true;
        }
      }
      else if(currentRes == "2.8K Ana")
      {
        if(btnAPressed)
        {
          // 2.6K 16:9
          width = 2688; height = 1512;
          window = true;
        }
        else
        {
          // 4K UHD
          width = 3840; height = 2160;
          window = true;
        }
      }
      else if(currentRes == "2.6K 16:9")
      {
        if(btnAPressed)
        {
          // HD
          width = 1920; height = 1080;
          window = true;
        }
        else
        {
          // 2.8K Ana
          width = 2880; height = 2160;
          window = true;
        }
      }
      else // HD
      {
        if(btnAPressed)
        {
          // 4K DCI
          width = 4096; height = 2160;
        }
        else
        {
          // 2.6K 16:9
          width = 2688; height = 1512;
          window = true;
        }
      }

