marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey.cpp
    // 4K UHD
    labelRes = "4K UHD";
    sprite->fillSmoothRoundRect(115, 30, 90, 40, 3, (currentRes == labelRes ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString("UHD", 160, 41);

    // HD
    labelRes = "HD";
    sprite->fillSmoothRoundRect(210, 30, 100, 40, 3, (currentRes == labelRes ? TFT_DARKGREEN : TFT_DARKGREY));
    sprite->drawCentreString("HD", 260, 41);

    // Sensor Area

    // 4K DCI is Scaled from 5.7K, Ultra HD is Scaled from Full or 5.7K, HD is Scaled from Full, 5.7K, or 2.8K (however we can't change the 5.7K or 2.8K)

    sprite->drawString(currentRecordingFormat.frameWidthHeight_string().c_str(), 30, 90, &Lato_Regular5pt7b);
    sprite->drawString("SCALED / SENSOR AREA", 30, 105);

    if(currentRes == "4K DCI")
    {
      // Full sensor area only]
      sprite->fillSmoothRoundRect(20, 135, 90, 40, 3, TFT_DARKGREEN);
      sprite->drawCentreString("FULL", 65, 145);
    }
    else if(currentRes == "4K UHD")
    {
      // Full sensor area only]
      sprite->fillSmoothRoundRect(20, 135, 120, 40, 3, TFT_DARKGREEN);
      sprite->drawCentreString("WINDOW", 80, 145);
    }
    else
    {
      // HD

      // Scaled from Full, 2.6K or Windowed (however we can't tell which)
      sprite->fillSmoothRoundRect(20, 135, 290, 40, 3, TFT_DARKGREEN);
      sprite->drawCentreString("FULL / 2.6K / WINDOW", 165, 140);
      sprite->drawCentreString("CHECK/SET ON CAMERA", 165, 161, &Lato_Regular5pt7b);
    }
  }
  else
    DEBUG_ERROR("Resolution Pocket 4K - Codec not catered for.");

  sprite->pushSprite(0, 0);
}

// Resolution screen for Pocket 6K
void Screen_Resolution6K(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Resolution;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // Pocket 6K Resolution and Sensor Windows

  // Get the current Resolution and Codec
  CCUPacketTypes::RecordingFormatData currentRecordingFormat;
  if(camera->hasRecordingFormat())
    currentRecordingFormat = camera->getRecordingFormat();

  // Get the current Codec values
  CodecInfo currentCodec = camera->getCodec();

  bool tappedAction = false;
  if(btnAPressed || btnBPressed)
  {
    DEBUG_DEBUG("Resolution6K: Btn A/B pressed");

    String currentRes = currentRecordingFormat.frameDimensionsShort_string().c_str();

    if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
    {
      int width = 0;
      int height = 0;
      bool window = false;

      if(currentRes == "6K")
      {
        if(btnAPressed)
        {
          // 6K 2.4:1
          width = 6144; height = 2560;
          window = true;
        }
        else
        {
          // 2.8K 17:9 - Note V8.1 width is 2880 not 2868
          width = 2880; height = 1512;
          window = true;
        }
      }
      else if(currentRes == "6K 2.4:1")
      {
        if(btnAPressed)
        {
          // 5.7K 17:9
          width = 5744; height = 3024;
          window = true;
        }
        else
        {
          // 6K
          width = 6144; height = 3456;
        }
      }
      else if(currentRes == "5.7K 17:9")
      {
        if(btnAPressed)
        {
          // 4K DCI
          width = 4096; height = 2160;
          window = true;
        }
        else
        {
          // 6K 2.4:1
          width = 6144; height = 2560;
          window = true;
        }
      }
      else if(currentRes == "4K DCI")
      {
        if(btnAPressed)
        {
          // 3.7K Anamorphic
          width = 3728; height = 3104;
          window = true;
        }
        else
        {
          // 5.7K 17:9
          width = 5744; height = 3024;
          window = true;
        }
      }
      else if(currentRes == "3.7K 6:5A")
      {
        if(btnAPressed)
        {
          // 2.8K 17:9 - Note V8.1 width is 2880 not 2868
          width = 2880; height = 1512;
          window = true;
        }
        else
        {
          // 4K DCI
          width = 4096; height = 2160;
          window = true;
        }
      }
      else // 2.8K 17:9
      {
        if(btnAPressed)
        {
          // 6K
          width = 6144; height = 3456;
        }
        else
        {
          // 3.7K Anamorphic
          width = 3728; height = 3104;
          window = true;
        }
      }

      if(width != 0)
      {
        // Resolution selected, write to camera
        CCUPacketTypes::RecordingFormatData newRecordingFormat = currentRecordingFormat;
        newRecordingFormat.width = width;
        newRecordingFormat.height = height;
        newRecordingFormat.windowedModeEnabled = window;
        PacketWriter::writeRecordingFormat(newRecordingFormat, &cameraConnection);

        tappedAction = true;
      }
    }
    else
    {
      // ProRes

      int width = 0;
      int height = 0;
      bool window = false;

      DEBUG_DEBUG("Before change:");
      DEBUG_DEBUG(currentRecordingFormat.frameDimensionsShort_string().c_str());
      DEBUG_DEBUG(currentRecordingFormat.frameRate_string().c_str());
      DEBUG_DEBUG("Frame Rate: %hi", currentRecordingFormat.frameRate);
      DEBUG_DEBUG("Off Speed Frame Rate: %hi", currentRecordingFormat.offSpeedFrameRate);
      DEBUG_DEBUG("Width: %i", currentRecordingFormat.width);
      DEBUG_DEBUG("Height: %i", currentRecordingFormat.height);
      DEBUG_DEBUG("mRateEnabled: %s", currentRecordingFormat.mRateEnabled ? "Yes" : "No");
      DEBUG_DEBUG("offSpeedEnabled: %s", currentRecordingFormat.offSpeedEnabled ? "Yes" : "No");
      DEBUG_DEBUG("interlacedEnabled: %s", currentRecordingFormat.interlacedEnabled ? "Yes" : "No");
      DEBUG_DEBUG("windowedModeEnabled: %s", currentRecordingFormat.windowedModeEnabled ? "Yes" : "No");
      DEBUG_DEBUG("sensorMRateEnabled: %s", currentRecordingFormat.sensorMRateEnabled ? "Yes" : "No");

      if(currentRes == "4K DCI")
      {
        if(btnAPressed)
        {
          // 4K UHD
          width = 3840; height = 2160;
          window = false;

          DEBUG_DEBUG("Trying to change to 4K UHD");
        }
        else
        {
          // HD
          width = 1920; height = 1080;
          window = false;

